/**********************************************************
*  	通过51单片机与DS302实现的----6位数码管世界线变化探测器
* 	 Author ：老猫
* 	 Version：V3.0
*	特点：在不使用寄存器的情况下直接扫描数码管
***********************************************************/
#include "reg52.h"			 //此文件中定义了单片机的一些特殊功能寄存器
#include "ds1302.h"	

typedef unsigned int u16;	  //对数据类型进行声明定义
typedef unsigned char u8;

char num=0;
u8 DisplayData[8];
unsigned char segs[13] = {0xfc,0x60,0xda,0xf2,0x66,0xb6,0xbe,0xe0,0xfe,0xf6,0x00,}; //位选0,1,2,3,4,5,6,7,8,9,null
unsigned char tongd[7] = {0xfe,0xfd,0xfb,0xf7,0xef,0xdf,0xff,};//段选

/*******************************************************************************
* 函 数 名         : delay
* 函数功能		   : 延时函数，i=1时，大约延时10us
*******************************************************************************/
void delay(u16 i)
{
	while(i--);	
}


/*******************************************************************************
* 函 数 名         : datapros()
* 函数功能		   : 时间读取处理转换函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void datapros() 	 
{
   	Ds1302ReadTime();
	DisplayData[0] = segs[TIME[2]/16];				//时
	DisplayData[1] = segs[TIME[2]&0x0f];				 
	DisplayData[2] = segs[TIME[1]/16];				//分
	DisplayData[3] = segs[TIME[1]&0x0f];	
	DisplayData[4] = segs[TIME[0]/16];				//秒
	DisplayData[5] = segs[TIME[0]&0x0f];
	/*****************************************************************************************************
	因DS1302的时间和日期都是BCD码，例如18分，读出来的数据是0001 1000，要显示出十位，要取出十位，
	即是取高4位，所以，要用TIME[1]/16，而TIME[1]&0x0f是取出个位，即低四位。其它的秒，小时，年月日等同理。
	******************************************************************************************************/
}


/*******************************************************************************
* 函数名         :DigDisplay()
* 函数功能		 :数码管显示函数
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/
void DigDisplay()
{
	u8 i;
	for(i=0;i<=6;i++)
	{
		P2 = tongd[i];//位选
		P1 = DisplayData[i];//发送数据
		delay(100); //间隔一段时间扫描	
		P1=0x00;//消隐
		P2 = tongd[7];
	}		
}

/*******************************************************************************
* 函 数 名       : main
* 函数功能		 : 主函数
* 输    入       : 无
* 输    出    	 : 无
*******************************************************************************/
void main()
{	
	Ds1302Init();
	while(1)
	{
		//P2 = tongd[1];//位选
		//P1 = segs[1];//发送数据
		datapros();	 //数据处理函数
		DigDisplay();//数码管显示函数		
	}		
}

